fix checkinservice
